# Общая структура программы
## Входные данные для обработки
## Вызов необходимых функций
### `Console.WriteLine()`
* В первой строке выводится оригинальный массив, для визуального представления и сравнения, после преобразования в понятный для восприятия вид. 
* В второй строке происходит двойной вложенный вызов функций, сначала происходит обработка массива (внутренняя часть) потом преобразование обработанного массива в человеко-понятный формат. Последний и выводится системной утилитой на экран.
## Функция выборки из массива по условию
* Определяем новый массив в первом приближении равным исходному.
* Устанавливаем счетчик "попаданий" в исходное состояние.
* Организуем цикл по массиву для перебора имеющихся значений `(слов)` по условию.
* Внутри цикла происходит проверка на соответствие требованиям и при совпадении слово заносится в новый массив, также увеличиваем счетчик совпадений.
* Изменяем полученный массив для устранения пустых мест и экономии памяти.
* Возвращаем полученный массив вызвавшей процедуре.

## Функция преобразования массива в строку
### В первом блоке идет порверка на пустоту и сообщение о необходимости непустого массива.
### Во втором блоке происходит собственно преобразование в удобный для восприяти вид.